
import { PROJECT_NAME } from "../project";

export const faqSection = {
  title: '疑问解答',
  faqs: [
    {
      question: '这和传统的匿名举报有什么区别？',
      answer: `传统渠道（如报警或媒体）仍存在中心化机构泄露身份的风险，且你承担了巨大的压力却得不到经济保障。${PROJECT_NAME.full} 利用 Web3 协议彻底消除了单点故障，并用加密资产提供实质回报。`
    },
    {
      question: '出售犯罪证据赚钱，这道德吗？',
      answer: '既然作恶者可以为了金钱无恶不作，好人为了钱做正义的事情天经地义。2023年 SEC（美国证券交易委员会）给金融犯罪吹哨人的奖金超 2.79 亿美金，证明了“为正义付费”是绝对可行的。'
    },
    {
      question: '如果有人利用平台造谣或敲诈勒索怎么办？',
      answer: `平台绝不庇护恶作剧和敲诈勒索。${PROJECT_NAME.full} 拥有基于 DAO 社区治理的黑名单机制，纯粹的造谣或涉及普通人隐私的内容会被坚决抵制，无法获得任何收益。`
    },
    {
      question: '证据为什么最终一定会公开？',
      answer: `我们的初衷是曝光真相，智能合约中写死了最终结局：**没有任何证据可以被永久买断和隐藏。**。因此，证据最终必然公开。`
    },
    {
      question: '买家一定会付款吗？那如果没人买怎么办？',
      answer: `从现实案例和市场逻辑来看，只要证据是真实的，就会存在买家。`
    },
    {
      question: '如何保证证据的真实性？',
      answer: `在证据盒子未公开之前，除了创建者，没有人知道证据里具体是什么，只有利益相关方才会急切想知道是真是假。`
    },
    {
      question: '我需要注册账号吗？需要提交信息吗？',
      answer: `不需要注册任何账号，项目基于web3生态，只需要一个web3钱包即可。也不需要提供任何个人身份信息。`
    },
    {
      question: '没有 Web3 钱包，还能使用吗？',
      answer: `完全可以，对于非web3用户，我们会自动为你生成一个账户地址，你甚至都不需要支付gas费，整个流程将由我们代为支付。不过仅限于上传证据。`
    },
    {
      question: '假如警察或者法院想要调取证据，你们会配合吗？',
      answer: `Evidence Market的运作基于智能合约，天然具备不可篡改、不可删除、抗审查的特性。一切只能按照智能合约的代码运行，并不受外部力量干扰。`
    },
    {
      question: '如何保证用户的隐私？',
      answer: `Evidence Market的运作基于智能合约，天然具备不可篡改、不可删除、抗审查的特性。一切只能按照智能合约的代码运行，并不受外部力量干扰。`
    },
  ]
};
